#### Workbook to design tables

In [1]:
import os
import glob
import psycopg2
import pandas as pd
import numpy as np
import json
import csv

#### Create PostgreSQL development database

In [2]:
# connect to default database
conn = psycopg2.connect("host=127.0.0.1 dbname=studentdb user=student password=student")
conn.set_session(autocommit=True)
cur = conn.cursor()

In [3]:
# be careful with this!!!

# create capstone database with UTF8 encoding
cur.execute("DROP DATABASE IF EXISTS capstone")
cur.execute("CREATE DATABASE capstone WITH ENCODING 'utf8' TEMPLATE template0")

# close connection to default database
conn.close()

In [4]:
# connect to capstone database
conn = psycopg2.connect("host=127.0.0.1 dbname=capstone user=student password=student")
conn.set_session(autocommit=True)
cur = conn.cursor()

In [5]:
%load_ext sql

In [6]:
%sql postgresql://student:student@127.0.0.1/capstone

'Connected: student@capstone'

In [8]:
def get_files(filepath, filetemplate):
    all_files = []
    for root, dirs, files in os.walk(filepath):
        files = glob.glob(os.path.join(root,filetemplate))
        for f in files :
            all_files.append(os.path.abspath(f))
    
    return all_files

In [9]:
csv_files = get_files(".", '*.csv')
for f in csv_files: print(f)

/home/workspace/data/us-cities-demographics.csv
/home/workspace/data/airport-codes-clean.csv
/home/workspace/data/airport-test.csv
/home/workspace/data/i94_countries.csv
/home/workspace/data/us-zip-code-latitude-and-longitude.csv
/home/workspace/data/i94_states.csv
/home/workspace/data/i94_modes.csv
/home/workspace/data/immigration_data_sample.csv
/home/workspace/data/i94_ports_entry.csv
/home/workspace/data/i94_visas.csv
/home/workspace/data/GlobalLandTemperaturesByCity.csv
/home/workspace/data/airport-codes_csv.csv
/home/workspace/data/.ipynb_checkpoints/i94_modes-checkpoint.csv
/home/workspace/data/.ipynb_checkpoints/us-cities-demographics-checkpoint.csv
/home/workspace/data/.ipynb_checkpoints/i94_visas-checkpoint.csv
/home/workspace/data/.ipynb_checkpoints/i94_states-checkpoint.csv
/home/workspace/data/.ipynb_checkpoints/us-zip-code-latitude-and-longitude-checkpoint.csv
/home/workspace/data/.ipynb_checkpoints/i94_countries-checkpoint.csv
/home/workspace/data/.ipynb_checkpoints/i94_ports_entry-checkpoint.csv
/home/workspace/.ipynb_checkpoints/airport-codes_csv-checkpoint.csv
/home/workspace/.ipynb_checkpoints/i94_states-checkpoint.csv
/home/workspace/.ipynb_checkpoints/i94_countries-checkpoint.csv

In [10]:
conn.commit()

In [11]:
conn.rollback()

#### Munge City Temp (stg_city_temp)

In [7]:
stg_city_temp_create = ("""
CREATE TABLE IF NOT EXISTS stg_city_temp(
    measure_dt DATE,                               -- dt
    avg_temp NUMERIC(8,3),                         -- AverageTemperature
    avg_temp_uncertainty NUMERIC(8,3),             -- AverageTemperatureUncertainty
    city VARCHAR,
    country VARCHAR,
    latitude VARCHAR,
    longitude VARCHAR)
""")

stg_city_temp_drop = "DROP TABLE IF EXISTS stg_city_temp"

In [8]:
cur.execute(stg_city_temp_drop)
cur.execute(stg_city_temp_create)

In [9]:
city_temp_fname = '../../data2/GlobalLandTemperaturesByCity.csv'
with open(city_temp_fname, 'r', encoding='utf-8') as f:
  next(f)   # skip the header row
  cur.copy_from(f, 'stg_city_temp', sep=',', null='')
conn.commit()

# alternate method

city_temp_insert = ("""
INSERT INTO stg_city_temp(dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude)
VALUES (%s, %s, %s, %s, %s, %s, %s)
""")

with open('../../data2/GlobalLandTemperaturesByCity.csv', 'r') as f:
  reader = csv.reader(f)
  foo = next(reader) # Skip the header row.
  print(type(foo))
  print(foo)
  i = 0
  for r in reader:
    i += 1
    foo = (r[0], r[1],r[2],r[3],r[4],r[5],r[6])
    if i>10: break
    try:
      cur.execute(city_temp_insert, foo)
      #print(f'Successfully input row {i} value{r}')
    except UnicodeEncodeError:
      print(f'UnicodeEncodeError in row {i} value {r}')
  conn.commit()

#### Munge City Demo (stg_city_demo)

In [82]:
stg_city_demo_create = ("""
CREATE TABLE IF NOT EXISTS stg_city_demo(
    City VARCHAR,
    State VARCHAR,
    Median_Age REAL,           -- Median Age
    Male_Pop BIGINT,           -- Male Population
    Female_pop BIGINT,         -- Female Population
    Total_pop BIGINT,          -- Total Population
    Num_Veterans BIGINT,       -- Number of Veterans
    Foreign_Born BIGINT,       -- Foreign-born
    Avg_Household_Size REAL,   -- Average Household Size
    State_Code VARCHAR,        -- State Code
    Race VARCHAR,
    Count BIGINT)
""")

stg_city_demo_drop = "DROP TABLE IF EXISTS stg_city_demo"

In [84]:
cur.execute(stg_city_demo_drop)
cur.execute(stg_city_demo_create)

In [85]:
# version 0 - using psycopg2 wrapper for Postgres COPY

city_demo_fname = 'data/us-cities-demographics.csv'
with open(city_demo_fname, 'r', ) as f:
  #next(f) # Skip the header row.
  f.__next__()
  cur.copy_from(f, 'stg_city_demo', sep=';', null='')  # interpret empty string as NULL
conn.commit()

# Alternate versions

# City Demographics (stg_city_demo) insert statement
city_demo_insert = ("""
INSERT INTO stg_city_demo(City,State,MedianAge,MalePopulation,FemalePopulation,TotalPopulation,NumberVeterans,ForeignBorn,AverageHouseholdSize,StateCode,Race,Count)
VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
""")

# version 1 - using csv reader within with 

with open('us-cities-demographics.csv', 'r') as f:
  reader = csv.reader(f, delimiter=';')   # returns an iterator of lists representing rows
  next(reader) # Skip the header row.

  for row in reader:
    try:
      cur.execute(city_demo_insert, row)
    except psycopg2.DataError as e:    # detects null columns in csv; zap em with None that is interpreted as SQL NULL by psycopg2/Postgres
      for j, v in enumerate(row):
        if v=='':
          row[j] = None
      cur.execute(city_demo_insert, row)
    except UnicodeEncodeError:

  conn.commit()

# Version 2 - using csv reader direct

#reader = csv.reader(codecs.open('us-cities-demographics.csv', encoding='utf-8'), delimiter=';')
f = open('us-cities-demographics.csv')
reader = csv.reader(f, delimiter=';')
next(reader) # Skip the header row.
for r in reader:
  try:
    cur.execute(city_demo_insert, r)
  except psycopg2.DataError as e:
    for j, v in enumerate(r):
      if v=='':
        r[j] = None
    cur.execute(city_demo_insert, r)
  except UnicodeEncodeError:
    print('Unicode', i, r)

f.close()
conn.commit()

# Version 3 - using pandas

df_city_demo = pd.read_csv('us-cities-demographics.csv', sep=';')    
#print(type(df_city_demo))
#print(df_city_demo.shape)
#print(df_city_demo.count())
#print(len(df_city_demo))
#print(df_city_demo.head())

# rename the columns
df_city_demo.columns = ["City","State","MedianAge","MalePopulation","FemalePopulation","TotalPopulation",
                        "NumberVeterans","ForeignBorn","AverageHouseholdSize","StateCode","Race","Count"] 

df_city_demo = df_city_demo.where(pd.notnull(df_city_demo), None)  # magic zaps NaN to None which can be interpreted as NULL by psycopg2/Postgres

for i, row in df_city_demo.iterrows():
    cur.execute(city_demo_insert, row)

conn.commit()

#### Munge Airport Codes (stg_airport)

Hacks on airport-codes_csv.csv to create airport-codes-clean.csv:
1) Removed double quote around coordinates to create two distinct columns longitude and latitude
2) Replaced single quotes with double quotes for Name values which include a comma.
3) Replaced single quotes with double quotes for Municipality values which include a comma.
4) Deleted a few obviously dirty records

In [62]:
stg_airport_create = ("""
CREATE TABLE IF NOT EXISTS stg_airport(
    ident VARCHAR,
    type VARCHAR,
    name VARCHAR,
    elevation_ft INT,
    continent VARCHAR,
    iso_country VARCHAR,
    iso_region VARCHAR,
    municipality VARCHAR,
    gps_code VARCHAR,
    iata_code VARCHAR,
    local_code VARCHAR,
    longitude NUMERIC,  -- note should reverse order of these since latitude normally goes first...
    latitude NUMERIC)
""")

stg_airport_drop = "DROP TABLE IF EXISTS stg_airport"

In [63]:
cur.execute(stg_airport_drop)
cur.execute(stg_airport_create)

In [64]:
# using psycopg2 pass thru wrapper for Postgres COPY called copy_expert()
# necessary to use copy_expert() since we need to specify option QUOTE which is not exposed on the basic copy_from() method

airport_fname = 'data/airport-codes-clean.csv'
copy_command = """
COPY stg_airport FROM STDIN WITH ( FORMAT csv, HEADER, DELIMITER ',' , NULL '' , QUOTE '"' ) 
"""
with open(airport_fname, 'r', ) as f:
  cur.copy_expert(copy_command, f)
conn.commit()

#### Munge I94 Immigration Data (stg_i94)

##### Read I94 data into Pandas dataframe (note this is stressful wrt memory)

In [10]:
# Note: the data was examined in Pandas dataframe to determine which columns could be defined as BIGINT vs INT vs NUMERIC vs VARCHAR

stg_i94_create = ("""
CREATE TABLE IF NOT EXISTS stg_i94(
    cicid BIGINT, 
    i94yr INT, 
    i94mon INT, 
    i94cit VARCHAR,    
    i94res VARCHAR,    
    i94port VARCHAR, 
    arrdate INT,       -- 19600101+
    i94mode VARCHAR, 
    i94addr VARCHAR, 
    depdate INT,       -- 19600101+
    i94bir INT,        -- really age
    i94visa VARCHAR,    
    count INT, 
    dtadfile VARCHAR,     -- YYYYMMDD  this is a clean column
    visapost VARCHAR, 
    occup VARCHAR, 
    entdepa VARCHAR, 
    entdepd VARCHAR, 
    entdepu VARCHAR, 
    matflag VARCHAR, 
    biryear INT, 
    dtaddto VARCHAR,      -- MMDDYYYY  this is a dirty column 
    gender VARCHAR, 
    insnum VARCHAR, 
    airline VARCHAR, 
    admnum VARCHAR, 
    fltno VARCHAR, 
    visatype VARCHAR)
""")

stg_i94_drop = "DROP TABLE IF EXISTS stg_i94"

In [11]:
cur.execute(stg_i94_drop)
cur.execute(stg_i94_create)

In [12]:
pd.set_option('display.max_columns', 1000)
pd.set_option('display.max_rows', 100)

In [13]:
# use this shortcut to load i94 data more quickly from previously built parquet files
# need to install pyarrow library via: pip install pyarrow
import pyarrow as py
df_i94_jan_pd = pd.read_parquet('sas_data_16jan', engine='pyarrow')
print('df_i94_jan_pd has shape:', df_i94_jan_pd.shape)  
df_i94_jul_pd = pd.read_parquet('sas_data_16jul', engine='pyarrow')
print('df_i94_jul_pd has shape:', df_i94_jul_pd.shape)

df_i94_jan_pd has shape: (2847924, 28)
df_i94_jul_pd has shape: (4265031, 28)

In [14]:
df_i94_apr_pd = pd.read_parquet('sas_data_16apr', engine='pyarrow')
print('df_i94_apr_pd has shape:', df_i94_apr_pd.shape)  
df_i94_oct_pd = pd.read_parquet('sas_data_16oct', engine='pyarrow')
print('df_i94_oct_pd has shape:', df_i94_oct_pd.shape)

df_i94_apr_pd has shape: (3096313, 28)
df_i94_oct_pd has shape: (3649136, 28)

#### Skip over this if loading via pandas/pyarrow

In [65]:
# read the SAS dataset directly into pandas (somewhat slow)
i94_jan_fname = '../../data/18-83510-I94-Data-2016/i94_jan16_sub.sas7bdat'
df_i94_jan_pd = pd.read_sas(i94_jan_fname, 'sas7bdat', encoding="ISO-8859-1")

In [29]:
print('df_i94_jan_pd has shape:', df_i94_jan_pd.shape)
print('df_i94_jan_pd has a total of:', df_i94_jan_pd.size, 'elements')    
#print('df_i94_jan_pd column info:')
#print(df_i94_jan_pd.dtypes)#
display(df_i94_jan_pd.head())

df_i94_jan_pd has shape: (2847924, 28)
df_i94_jan_pd has dimension: 2
df_i94_jan_pd has a total of: 79741872 elements

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,7.0,2016.0,1.0,101.0,101.0,BOS,20465.0,1.0,MA,NaN,20.0,3.0,1.0,None,None,None,T,None,None,None,1996.0,D/S,M,None,LH,346608285.0,424,F1
1,8.0,2016.0,1.0,101.0,101.0,BOS,20465.0,1.0,MA,NaN,20.0,3.0,1.0,None,None,None,T,None,None,None,1996.0,D/S,M,None,LH,346627585.0,424,F1
2,9.0,2016.0,1.0,101.0,101.0,BOS,20469.0,1.0,CT,20480.0,17.0,2.0,1.0,None,None,None,T,N,None,M,1999.0,07152016,F,None,AF,381092385.0,338,B2
3,10.0,2016.0,1.0,101.0,101.0,BOS,20469.0,1.0,CT,20499.0,45.0,2.0,1.0,None,None,None,T,N,None,M,1971.0,07152016,F,None,AF,381087885.0,338,B2
4,11.0,2016.0,1.0,101.0,101.0,BOS,20469.0,1.0,CT,20499.0,12.0,2.0,1.0,None,None,None,T,N,None,M,2004.0,07152016,M,None,AF,381078685.0,338,B2

In [32]:
# read the SAS dataset directly into pandas (somewhat slow)
i94_jul_fname = '../../data/18-83510-I94-Data-2016/i94_jul16_sub.sas7bdat'
df_i94_jul_pd = pd.read_sas(i94_jul_fname, 'sas7bdat', encoding="ISO-8859-1")

In [30]:
print('df_i94_jul_pd has shape:', df_i94_jul_pd.shape)
print('df_i94_jul_pd has a total of:', df_i94_jul_pd.size, 'elements') 
display(df_i94_jul_pd.head())

df_i94_jul_pd has shape: (4265031, 28)
df_i94_jul_pd has a total of: 119420868 elements

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,1.0,2016.0,7.0,254.0,276.0,LOS,20636.0,1.0,CA,20640.0,38.0,2.0,1.0,20160701,None,None,G,O,None,M,1978.0,09282016,M,None,OZ,6.309290e+10,00202,WT
1,2.0,2016.0,7.0,140.0,140.0,NYC,20636.0,1.0,NY,20657.0,45.0,2.0,1.0,20160701,None,None,G,O,None,M,1971.0,09282016,F,None,DL,6.309290e+10,09858,WT
2,3.0,2016.0,7.0,135.0,135.0,ORL,20636.0,1.0,FL,20657.0,10.0,2.0,1.0,20160701,None,None,G,O,None,M,2006.0,09282016,M,None,VS,6.309290e+10,00071,WT
3,4.0,2016.0,7.0,124.0,124.0,TAM,20636.0,1.0,FL,20645.0,17.0,2.0,1.0,20160701,None,None,G,O,None,M,1999.0,09282016,M,None,LH,6.309290e+10,00482,WT
4,5.0,2016.0,7.0,130.0,130.0,LOS,20636.0,1.0,CA,20662.0,1.0,2.0,1.0,20160701,None,None,G,K,None,M,2015.0,09282016,M,None,SU,6.309290e+10,00106,WT

#### Cleanse the dataframes

#### Cleanse the dataframes

* Note that pandas imports the data with poorly defined datatypes: all numbers are float64; all strings are object. In addition np.nan/NaN values are used for both datatypes and those are not compatible with PostgreSQL which uses NULL for this purpose..
* Therefore it is necessary to remove the NaN values and replace with None/NULL prior to insert into PostgreSQL.
* Use the pandas notna() utility for this purpose.
* Also take advantage of this step to reduce the subset of data to be pulled from SAS/Pandas into PostgreSQL.
* One way to do this is to use a pandas query filter to pick an equivalent, representative subset of days from each of the months.

In [15]:
%%sql
select month, delta from (
select date('2016-01-14') - date('1960-01-01') as delta, 'jan' as month
union
select date('2016-04-14') - date('1960-01-01') as delta, 'apr' as month
union
select date('2016-07-14') - date('1960-01-01') as delta, 'jul' as month
union
select date('2016-10-14') - date('1960-01-01') as delta, 'oct' as month
) x order by delta;

 * postgresql://student:***@127.0.0.1/capstone
4 rows affected.

[('jan', 20467), ('apr', 20558), ('jul', 20649), ('oct', 20741)]

In [16]:
# either use a subset...
df0 = df_i94_jan_pd.query('arrdate>=20467 & arrdate<=(20467+1)')  # pull in N+1 sample days from approx 3rd week of January
df_jan = df0.where(pd.notna(df0), None)   

# ... or alternatively use the entire month
#df_jan = df_i94_jan_pd.where(pd.notna(df_i94_jan_pd), None)  

#print(df_jan.info())
print('df_jan has shape:', df_jan.shape)
display(df_jan.head(5))

df_jan has shape: (187181, 28)

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
34,60,2016,1,101,101,NYC,20468,1,NJ,20522,24,3,1,None,None,None,T,O,None,M,1992,D/S,F,None,AZ,3.74253e+08,608,F1
35,61,2016,1,101,101,NYC,20468,1,NY,None,62,2,1,None,None,None,T,None,None,None,1954,07142016,M,None,TK,3.71906e+08,11,B2
45,78,2016,1,101,101,TAM,20468,1,FL,None,69,2,1,None,None,None,T,None,None,None,1947,07142016,F,None,BA,3.75846e+08,2167,B2
46,79,2016,1,101,101,TAM,20468,1,FL,None,69,2,1,None,None,None,T,None,None,None,1947,07142016,M,None,BA,3.75554e+08,2167,B2
47,80,2016,1,101,101,TAM,20468,1,FL,None,63,2,1,None,None,None,T,None,None,None,1953,07142016,F,None,BA,3.75579e+08,2167,B2

In [17]:
# either use a subset...
df0 = df_i94_jul_pd.query('arrdate>=20649 & arrdate<=(20649+1)')  # pull in N+1 sample days from approx 3rd week of July
df_jul = df0.where(pd.notna(df0), None)   

# ... or alternatively use the entire month
#df_jul = df_i94_jul_pd.where(pd.notna(df_i94_jul_pd), None)  

#print(df_jul.info())
print('df_jul has shape:', df_jul.shape)
display(df_jul.head(5))

df_jul has shape: (289558, 28)

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
1667274,3.03769e+06,2016,7,129,129,MIA,20649,1,None,None,28,2,1,20160714,None,None,H,None,None,None,1988,09282016,F,None,AA,6.31019e+10,00158,WT
1667275,3.03769e+06,2016,7,464,464,SFR,20649,1,CA,20654,69,2,1,20160714,None,None,H,O,None,M,1947,09292016,M,None,AC,6.31163e+10,00781,WT
1667276,3.03769e+06,2016,7,135,438,SFR,20649,1,CA,20654,60,2,1,20160714,None,None,H,O,None,M,1956,09292016,M,None,AS,6.3119e+10,00223,WT
1667277,3.03769e+06,2016,7,438,438,SFR,20649,1,CA,20652,37,2,1,20160714,None,None,H,O,None,M,1979,09282016,M,None,UA,6.30917e+10,01118,WT
1667278,3.0377e+06,2016,7,111,689,NYC,20649,1,NY,20651,49,2,1,20160714,None,None,H,O,None,M,1967,09292016,M,None,G7,6.31145e+10,06299,WT

In [18]:
# either use a subset...
df0 = df_i94_apr_pd.query('arrdate>=20558 & arrdate<=(20558+1)')  # pull in N+1 sample days from approx 3rd week of month
df_apr = df0.where(pd.notna(df0), None)   

# ... or alternatively use the entire month
#df_apr = df_i94_apr_pd.where(pd.notna(df_i94_apr_pd), None)  

#print(df_apr.info())
print('df_apr has shape:', df_apr.shape)
display(df_apr.head(5))

df_apr has shape: (222360, 28)

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
1197704,2.47916e+06,2016,4,101,101,BOS,20558,1,MA,None,66,2,1,20160414,None,None,T,None,None,None,1950,10132016,F,None,AZ,8.00432e+08,614,B2
1197707,2.47916e+06,2016,4,101,101,NYC,20558,1,NE,20564,25,2,1,20160414,None,None,O,O,None,M,1991,10132016,None,None,SU,9.3506e+10,00100,B2
1197708,2.47916e+06,2016,4,101,101,NYC,20558,1,NY,20567,27,2,1,20160414,None,None,O,O,None,M,1989,10132016,None,None,DL,9.35235e+10,00445,B2
1197709,2.47916e+06,2016,4,101,101,NYC,20558,1,NY,20572,40,2,1,20160414,None,None,O,O,None,M,1976,10132016,None,None,AZ,9.35395e+10,00610,B2
1197710,2.47916e+06,2016,4,101,101,NYC,20558,1,NY,20572,37,2,1,20160414,None,None,O,O,None,M,1979,10132016,None,None,AZ,9.35395e+10,00610,B2

In [19]:
# either use a subset...
df0 = df_i94_oct_pd.query('arrdate>=20741 & arrdate<=(20741+1)')  # pull in N+1 sample days from approx 3rd week of month
df_oct = df0.where(pd.notna(df0), None)   

# ... or alternatively use the entire month
#df_oct = df_i94_jan_pd.where(pd.notna(df_i94_oct_pd), None)  

#print(df_oct.info())
print('df_oct has shape:', df_oct.shape)
display(df_oct.head(5))

df_oct has shape: (267063, 28)

,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
1496316,2.70145e+06,2016,10,111,111,CHM,20741,9,FL,None,27,2,1,20161014,None,None,A,None,None,None,1989,01122017,M,5531,None,6.70112e+10,None,WT
1496317,2.70146e+06,2016,10,104,104,CHM,20741,9,FL,None,28,2,1,20161014,None,None,A,None,None,None,1988,01122017,F,5317,None,6.70112e+10,None,WT
1496318,2.70146e+06,2016,10,104,104,CHM,20741,9,FL,None,29,2,1,20161014,None,None,A,W,None,M,1987,01122017,U,5317,None,6.70112e+10,None,WT
1496319,2.70146e+06,2016,10,104,104,XXX,20741,9,FL,None,28,2,1,20161014,None,None,A,None,None,None,1988,01132017,M,5317,None,6.70112e+10,None,WT
1496320,2.7015e+06,2016,10,209,209,SAI,20741,1,None,20743,24,2,1,20161014,None,None,A,D,None,M,1992,11272016,M,3973,DL,7.41426e+10,00298,GMT

In [20]:
def load_i94(df, max_rows = 999_999_999, chunk_size = 10_000):
    """Utility function to efficiently load i94 data from a pandas dataframe into a PostgreSQL staging table. 
       Parameters: df - dataframe to load; max_rows - maximum row cutoff; chunk_size - number of rows to load in each call to executemany()
    """
    i94_table_insert = ("""
    INSERT INTO stg_i94(cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,
                        visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype) 
    VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)
    --ON CONFLICT (cicid)
    --  DO NOTHING
    """)   

    tot_rows = len(df)
    i = 0
    buf = list()
    for row in df.itertuples(index = False):
        #print(f'loading buf[{i%chunk}] with row {i}')
        buf.append(row)
        if (i+1)%chunk_size==0 or (i+1) == max_rows or (i+1) == tot_rows:
            print(f'dumping buffer sized {len(buf)} at row {i}')
            try:   
                cur.executemany(i94_table_insert, buf)
                buf = list()
            except Exception as f:
                print(f)
                print(i, row)
        if (i+1)>=max_rows: break
        i += 1

In [21]:
load_i94(df_jan)

dumping buffer sized 10000 at row 9999
dumping buffer sized 10000 at row 19999
dumping buffer sized 10000 at row 29999
dumping buffer sized 10000 at row 39999
dumping buffer sized 10000 at row 49999
dumping buffer sized 10000 at row 59999
dumping buffer sized 10000 at row 69999
dumping buffer sized 10000 at row 79999
dumping buffer sized 10000 at row 89999
dumping buffer sized 10000 at row 99999
dumping buffer sized 10000 at row 109999
dumping buffer sized 10000 at row 119999
dumping buffer sized 10000 at row 129999
dumping buffer sized 10000 at row 139999
dumping buffer sized 10000 at row 149999
dumping buffer sized 10000 at row 159999
dumping buffer sized 10000 at row 169999
dumping buffer sized 10000 at row 179999
dumping buffer sized 7181 at row 187180

In [22]:
load_i94(df_jul)

dumping buffer sized 10000 at row 9999
dumping buffer sized 10000 at row 19999
dumping buffer sized 10000 at row 29999
dumping buffer sized 10000 at row 39999
dumping buffer sized 10000 at row 49999
dumping buffer sized 10000 at row 59999
dumping buffer sized 10000 at row 69999
dumping buffer sized 10000 at row 79999
dumping buffer sized 10000 at row 89999
dumping buffer sized 10000 at row 99999
dumping buffer sized 10000 at row 109999
dumping buffer sized 10000 at row 119999
dumping buffer sized 10000 at row 129999
dumping buffer sized 10000 at row 139999
dumping buffer sized 10000 at row 149999
dumping buffer sized 10000 at row 159999
dumping buffer sized 10000 at row 169999
dumping buffer sized 10000 at row 179999
dumping buffer sized 10000 at row 189999
dumping buffer sized 10000 at row 199999
dumping buffer sized 10000 at row 209999
dumping buffer sized 10000 at row 219999
dumping buffer sized 10000 at row 229999
dumping buffer sized 10000 at row 239999
dumping buffer sized 10000 at row 249999
dumping buffer sized 10000 at row 259999
dumping buffer sized 10000 at row 269999
dumping buffer sized 10000 at row 279999
dumping buffer sized 9558 at row 289557

In [23]:
load_i94(df_apr)

dumping buffer sized 10000 at row 9999
dumping buffer sized 10000 at row 19999
dumping buffer sized 10000 at row 29999
dumping buffer sized 10000 at row 39999
dumping buffer sized 10000 at row 49999
dumping buffer sized 10000 at row 59999
dumping buffer sized 10000 at row 69999
dumping buffer sized 10000 at row 79999
dumping buffer sized 10000 at row 89999
dumping buffer sized 10000 at row 99999
dumping buffer sized 10000 at row 109999
dumping buffer sized 10000 at row 119999
dumping buffer sized 10000 at row 129999
dumping buffer sized 10000 at row 139999
dumping buffer sized 10000 at row 149999
dumping buffer sized 10000 at row 159999
dumping buffer sized 10000 at row 169999
dumping buffer sized 10000 at row 179999
dumping buffer sized 10000 at row 189999
dumping buffer sized 10000 at row 199999
dumping buffer sized 10000 at row 209999
dumping buffer sized 10000 at row 219999
dumping buffer sized 2360 at row 222359

In [24]:
load_i94(df_oct)

dumping buffer sized 10000 at row 9999
dumping buffer sized 10000 at row 19999
dumping buffer sized 10000 at row 29999
dumping buffer sized 10000 at row 39999
dumping buffer sized 10000 at row 49999
dumping buffer sized 10000 at row 59999
dumping buffer sized 10000 at row 69999
dumping buffer sized 10000 at row 79999
dumping buffer sized 10000 at row 89999
dumping buffer sized 10000 at row 99999
dumping buffer sized 10000 at row 109999
dumping buffer sized 10000 at row 119999
dumping buffer sized 10000 at row 129999
dumping buffer sized 10000 at row 139999
dumping buffer sized 10000 at row 149999
dumping buffer sized 10000 at row 159999
dumping buffer sized 10000 at row 169999
dumping buffer sized 10000 at row 179999
dumping buffer sized 10000 at row 189999
dumping buffer sized 10000 at row 199999
dumping buffer sized 10000 at row 209999
dumping buffer sized 10000 at row 219999
dumping buffer sized 10000 at row 229999
dumping buffer sized 10000 at row 239999
dumping buffer sized 10000 at row 249999
dumping buffer sized 10000 at row 259999
dumping buffer sized 7063 at row 267062

#### Process small I94 dimensions harvested from data dictionary I94_SAS_Labels_Descriptions.SAS

In [25]:
i94_states_create = ("""
CREATE TABLE IF NOT EXISTS i94_states_d(
    state_code VARCHAR,
    state_name VARCHAR)
""")

i94_states_drop = "DROP TABLE IF EXISTS i94_states_d"

In [26]:
cur.execute(i94_states_drop)
cur.execute(i94_states_create)

In [27]:
# Note that MP/Northern Mariana Islands, and OT/OTHER were added to the csv file manually.

i94_states_fname = 'data/i94_states.csv'
copy_command = """
COPY i94_states_d FROM STDIN WITH ( FORMAT csv, HEADER, DELIMITER ',' , NULL '' , QUOTE '''' ) 
"""
with open(i94_states_fname, 'r', ) as f:
  cur.copy_expert(copy_command, f)
conn.commit()

In [28]:
%sql select * from i94_states_d limit 4;

 * postgresql://student:***@127.0.0.1/capstone
4 rows affected.

[('AL', 'ALABAMA'), ('AK', 'ALASKA'), ('AZ', 'ARIZONA'), ('AR', 'ARKANSAS')]

In [29]:
i94_countries_create = ("""
CREATE TABLE IF NOT EXISTS i94_countries_d(
    country_code VARCHAR,
    country_name VARCHAR)
""")

i94_countries_drop = "DROP TABLE IF EXISTS i94_countries_d"

In [30]:
cur.execute(i94_countries_drop)
cur.execute(i94_countries_create)

In [31]:
# need to use copy_expert() because it allows use of PostgreSQL COPY command quote option. Single quotes needed to encapsulate some commas in country name column.
i94_countries_fname = 'data/i94_countries.csv'
copy_command = """
COPY i94_countries_d FROM STDIN WITH ( FORMAT csv, HEADER, DELIMITER ',' , NULL '' , QUOTE '''' ) 
"""
with open(i94_countries_fname, 'r', ) as f:
  cur.copy_expert(copy_command, f)
conn.commit()

In [32]:
%sql select * from i94_countries_d where country_name like 'MEX%' limit 5;

 * postgresql://student:***@127.0.0.1/capstone
1 rows affected.

[('582', 'MEXICO (Air, Sea, no land)')]

In [33]:
i94_ports_entry_create = ("""
CREATE TABLE IF NOT EXISTS i94_ports_entry_d(
    port_code VARCHAR,
    port_of_entry VARCHAR,
    state_code VARCHAR)
""")

i94_ports_entry_drop = "DROP TABLE IF EXISTS i94_ports_entry_d"

In [34]:
cur.execute(i94_ports_entry_drop)
cur.execute(i94_ports_entry_create)

In [35]:
# need to use copy_expert() because it allows use of PostgreSQL COPY command quote option. Single quotes needed to encapsulate some commas in port_of_entry column.
i94_ports_entry_fname = 'data/i94_ports_entry.csv'
copy_command = """
COPY i94_ports_entry_d FROM STDIN WITH ( FORMAT csv, HEADER, DELIMITER ',' , NULL '' , QUOTE '"' ) 
"""
with open(i94_ports_entry_fname, 'r', ) as f:
  cur.copy_expert(copy_command, f)
conn.commit()

In [36]:
%sql select * from i94_ports_entry_d limit 4;

 * postgresql://student:***@127.0.0.1/capstone
4 rows affected.

[('ALC', 'ALCAN, AK', 'AK'),
 ('ANC', 'ANCHORAGE, AK', 'AK'),
 ('BAR', 'BAKER AAF - BAKER ISLAND, AK', 'AK'),
 ('DAC', 'DALTONS CACHE, AK', 'AK')]

In [37]:
%sql select * from i94_ports_entry_d where state_code not in (select state_code from i94_states_d);

 * postgresql://student:***@127.0.0.1/capstone
0 rows affected.

[]

In [38]:
i94_visas_create = ("""
CREATE TABLE IF NOT EXISTS i94_visas_d(
    visa_code VARCHAR,
    visa_name VARCHAR)
""")

i94_visas_drop = "DROP TABLE IF EXISTS i94_visas_d"

In [39]:
cur.execute(i94_visas_drop)
cur.execute(i94_visas_create)

In [40]:
i94_visas_fname = 'data/i94_visas.csv'
with open(i94_visas_fname, 'r', ) as f:
  next(f) # Skip the header row.
  cur.copy_from(f, 'i94_visas_d', sep=',')  
conn.commit()

In [41]:
%sql select * from i94_visas_d limit 5;

 * postgresql://student:***@127.0.0.1/capstone
3 rows affected.

[('1', 'Business'), ('2', 'Pleasure'), ('3', 'Student')]

In [42]:
i94_modes_create = ("""
CREATE TABLE IF NOT EXISTS i94_modes_d(
    mode_code VARCHAR,
    mode_name VARCHAR)
""")

i94_modes_drop = "DROP TABLE IF EXISTS i94_modes_d"

In [43]:
cur.execute(i94_modes_drop)
cur.execute(i94_modes_create)

In [44]:
i94_modes_fname = 'data/i94_modes.csv'
with open(i94_modes_fname, 'r', ) as f:
  next(f) # Skip the header row.
  cur.copy_from(f, 'i94_modes_d', sep=',')  
conn.commit()

In [45]:
%sql select * from i94_modes_d limit 5;

 * postgresql://student:***@127.0.0.1/capstone
4 rows affected.

[('1', 'Air'), ('2', 'Sea'), ('3', 'Land'), ('9', 'Not reported')]

#### Munge zip code vs latitude longitude cross reference file

#### Process zip code vs latitute-longitude cross reference data

* In order to be able to match data from the city temp dataset to the I94 dataset we need to be able to enhance the former to include state codes. In its raw form the city temp dataset has a pseudo primary key of City name compounded with Latitude and Longitude. There is no state identifier which is necessary to match against the I94 dataset.
* In order to enhance the city test dataset to include state codes in addition to city names we can use the latitude and longitude from this dataset in conjunction with a cross reference dataset which has city, state and latitude, longitude data elements.
* Note that the provided airports dataset does have these data elements and this was considered as a possible source for the required cross reference data but there is not enough geographical coverage of US cities in that dataset so it was ultimately discarded.
* An alternative dataset with zip code, state, city to latitude, longitude cross reference capability was obtained at:
https://public.opendatasoft.com/explore/dataset/us-zip-code-latitude-and-longitude/information/
* Data structure: Zip;City;State;Latitude;Longitude;Timezone;Daylight savings time flag;geopoint

In [46]:
stg_zip_lat_lon_xref_create = ("""
CREATE TABLE IF NOT EXISTS stg_zip_lat_lon_xref(
    zip VARCHAR,
    city VARCHAR,
    state VARCHAR,
    latitude NUMERIC,
    longitude NUMERIC,
    timezone NUMERIC,
    dst_flag NUMERIC,
    geopoint VARCHAR)
""")

stg_zip_lat_lon_xref_drop = "DROP TABLE IF EXISTS stg_zip_lat_lon_xref"

In [47]:
cur.execute(stg_zip_lat_lon_xref_drop)
cur.execute(stg_zip_lat_lon_xref_create)

In [48]:
zip_lat_lon_fname = 'data/us-zip-code-latitude-and-longitude.csv'
with open(zip_lat_lon_fname, 'r', ) as f:
  #next(f) # Skip the header row.
  f.__next__()
  cur.copy_from(f, 'stg_zip_lat_lon_xref', sep=';', null='')  # interpret empty string as NULL
conn.commit()

In [49]:
%sql select count(*) from stg_zip_lat_lon_xref;

 * postgresql://student:***@127.0.0.1/capstone
1 rows affected.

[(43191,)]

In [50]:
%sql select * from stg_zip_lat_lon_xref where state='NJ' and zip like '0700%' order by zip;

 * postgresql://student:***@127.0.0.1/capstone
9 rows affected.

[('07001', 'Avenel', 'NJ', Decimal('40.578996'), Decimal('-74.27987'), Decimal('-5'), Decimal('1'), '40.578996,-74.27987'),
 ('07002', 'Bayonne', 'NJ', Decimal('40.666552'), Decimal('-74.11768000000001'), Decimal('-5'), Decimal('1'), '40.666552,-74.11768'),
 ('07003', 'Bloomfield', 'NJ', Decimal('40.803'), Decimal('-74.18895'), Decimal('-5'), Decimal('1'), '40.803,-74.18895'),
 ('07004', 'Fairfield', 'NJ', Decimal('40.879049'), Decimal('-74.29378'), Decimal('-5'), Decimal('1'), '40.879049,-74.29378'),
 ('07005', 'Boonton', 'NJ', Decimal('40.912798'), Decimal('-74.41516'), Decimal('-5'), Decimal('1'), '40.912798,-74.41516'),
 ('07006', 'Caldwell', 'NJ', Decimal('40.848999'), Decimal('-74.27917'), Decimal('-5'), Decimal('1'), '40.848999,-74.27917'),
 ('07007', 'Caldwell', 'NJ', Decimal('40.79185'), Decimal('-74.245241'), Decimal('-5'), Decimal('1'), '40.79185,-74.245241'),
 ('07008', 'Carteret', 'NJ', Decimal('40.582504'), Decimal('-74.22997'), Decimal('-5'), Decimal('1'), '40.582504,-74.22997'),
 ('07009', 'Cedar Grove', 'NJ', Decimal('40.855854'), Decimal('-74.22898'), Decimal('-5'), Decimal('1'), '40.855854,-74.22898')]

In [51]:
%sql select * from stg_zip_lat_lon_xref where city='Portland' order by zip limit 20;  -- Springfield and Portland are notoriously multi state cities

 * postgresql://student:***@127.0.0.1/capstone
20 rows affected.

[('04101', 'Portland', 'ME', Decimal('43.660525'), Decimal('-70.25862'), Decimal('-5'), Decimal('1'), '43.660525,-70.25862'),
 ('04102', 'Portland', 'ME', Decimal('43.658632'), Decimal('-70.2911'), Decimal('-5'), Decimal('1'), '43.658632,-70.2911'),
 ('04103', 'Portland', 'ME', Decimal('43.685882'), Decimal('-70.2903'), Decimal('-5'), Decimal('1'), '43.685882,-70.2903'),
 ('04104', 'Portland', 'ME', Decimal('43.84649'), Decimal('-70.464839'), Decimal('-5'), Decimal('1'), '43.84649,-70.464839'),
 ('04109', 'Portland', 'ME', Decimal('43.678339'), Decimal('-70.198742'), Decimal('-5'), Decimal('1'), '43.678339,-70.198742'),
 ('04112', 'Portland', 'ME', Decimal('44.408078'), Decimal('-70.470703'), Decimal('-5'), Decimal('1'), '44.408078,-70.470703'),
 ('04122', 'Portland', 'ME', Decimal('44.408078'), Decimal('-70.470703'), Decimal('-5'), Decimal('1'), '44.408078,-70.470703'),
 ('04123', 'Portland', 'ME', Decimal('44.408078'), Decimal('-70.470703'), Decimal('-5'), Decimal('1'), '44.408078,-70.470703'),
 ('04124', 'Portland', 'ME', Decimal('44.408078'), Decimal('-70.470703'), Decimal('-5'), Decimal('1'), '44.408078,-70.470703'),
 ('06480', 'Portland', 'CT', Decimal('41.588297'), Decimal('-72.60384'), Decimal('-5'), Decimal('1'), '41.588297,-72.60384'),
 ('14769', 'Portland', 'NY', Decimal('42.372864'), Decimal('-79.47523'), Decimal('-5'), Decimal('1'), '42.372864,-79.47523'),
 ('18351', 'Portland', 'PA', Decimal('40.920622'), Decimal('-75.09773'), Decimal('-5'), Decimal('1'), '40.920622,-75.09773'),
 ('37148', 'Portland', 'TN', Decimal('36.576137'), Decimal('-86.51355'), Decimal('-6'), Decimal('1'), '36.576137,-86.51355'),
 ('45770', 'Portland', 'OH', Decimal('38.988699'), Decimal('-81.8019'), Decimal('-5'), Decimal('1'), '38.988699,-81.8019'),
 ('47371', 'Portland', 'IN', Decimal('40.419489'), Decimal('-84.96936'), Decimal('-5'), Decimal('0'), '40.419489,-84.96936'),
 ('48875', 'Portland', 'MI', Decimal('42.864338'), Decimal('-84.91289'), Decimal('-5'), Decimal('1'), '42.864338,-84.91289'),
 ('58274', 'Portland', 'ND', Decimal('47.491179'), Decimal('-97.46343'), Decimal('-6'), Decimal('1'), '47.491179,-97.46343'),
 ('65067', 'Portland', 'MO', Decimal('38.751905'), Decimal('-91.69826'), Decimal('-6'), Decimal('1'), '38.751905,-91.69826'),
 ('71663', 'Portland', 'AR', Decimal('33.236401'), Decimal('-91.47982'), Decimal('-6'), Decimal('1'), '33.236401,-91.47982'),
 ('78374', 'Portland', 'TX', Decimal('27.884565'), Decimal('-97.32054'), Decimal('-6'), Decimal('1'), '27.884565,-97.32054')]

In [52]:
stg_city_lat_lon_xref_create = ("""
CREATE TABLE IF NOT EXISTS stg_city_lat_lon_xref(
    city VARCHAR,
    state VARCHAR,
    latitude NUMERIC,
    longitude NUMERIC,
    timezone NUMERIC,
    dst_flag NUMERIC,
    zip_count INT)
""")

stg_city_lat_lon_xref_drop = "DROP TABLE IF EXISTS stg_city_lat_lon_xref CASCADE"

In [53]:
cur.execute(stg_city_lat_lon_xref_drop)
cur.execute(stg_city_lat_lon_xref_create)

In [54]:
%%sql
insert into stg_city_lat_lon_xref 
select city, state state_code, round(avg(latitude),6) latitude, round(avg(longitude),6) longitude, min(timezone) timezone, min(dst_flag) dst_flag, count(*) zip_count
  from stg_zip_lat_lon_xref
 group by state, city
;

 * postgresql://student:***@127.0.0.1/capstone
30346 rows affected.

[]

In [55]:
%sql select * from stg_city_lat_lon_xref limit 20;

 * postgresql://student:***@127.0.0.1/capstone
20 rows affected.

[('Adak', 'AK', Decimal('51.879570'), Decimal('-176.636750'), Decimal('-10'), Decimal('1'), 1),
 ('Akiachak', 'AK', Decimal('60.889810'), Decimal('-161.423930'), Decimal('-9'), Decimal('1'), 1),
 ('Akiak', 'AK', Decimal('60.911865'), Decimal('-161.225770'), Decimal('-9'), Decimal('1'), 1),
 ('Akutan', 'AK', Decimal('54.098693'), Decimal('-165.881760'), Decimal('-9'), Decimal('1'), 1),
 ('Alakanuk', 'AK', Decimal('62.683391'), Decimal('-164.654550'), Decimal('-9'), Decimal('1'), 1),
 ('Aleknagik', 'AK', Decimal('59.269535'), Decimal('-158.624580'), Decimal('-9'), Decimal('1'), 1),
 ('Allakaket', 'AK', Decimal('66.557586'), Decimal('-152.655900'), Decimal('-9'), Decimal('1'), 1),
 ('Ambler', 'AK', Decimal('67.083658'), Decimal('-157.862250'), Decimal('-9'), Decimal('1'), 1),
 ('Anaktuvuk Pass', 'AK', Decimal('68.148216'), Decimal('-151.728540'), Decimal('-9'), Decimal('1'), 1),
 ('Anchor Point', 'AK', Decimal('59.798363'), Decimal('-151.735660'), Decimal('-9'), Decimal('1'), 1),
 ('Anchorage', 'AK', Decimal('61.157721'), Decimal('-149.747957'), Decimal('-9'), Decimal('1'), 24),
 ('Anderson', 'AK', Decimal('64.349263'), Decimal('-149.192650'), Decimal('-9'), Decimal('1'), 1),
 ('Angoon', 'AK', Decimal('57.487650'), Decimal('-134.572220'), Decimal('-9'), Decimal('1'), 1),
 ('Aniak', 'AK', Decimal('61.570981'), Decimal('-158.880720'), Decimal('-9'), Decimal('1'), 1),
 ('Anvik', 'AK', Decimal('62.632905'), Decimal('-160.213360'), Decimal('-9'), Decimal('1'), 1),
 ('Arctic Village', 'AK', Decimal('68.121828'), Decimal('-145.527680'), Decimal('-9'), Decimal('1'), 1),
 ('Atka', 'AK', Decimal('52.227555'), Decimal('-174.196280'), Decimal('-10'), Decimal('1'), 1),
 ('Atqasuk', 'AK', Decimal('70.477663'), Decimal('-157.418050'), Decimal('-9'), Decimal('1'), 1),
 ('Auke Bay', 'AK', Decimal('58.449413'), Decimal('-134.700348'), Decimal('-9'), Decimal('1'), 1),
 ('Barrow', 'AK', Decimal('71.299525'), Decimal('-156.748910'), Decimal('-9'), Decimal('1'), 1)]

In [56]:
%sql select count(*) from stg_city_lat_lon_xref;

 * postgresql://student:***@127.0.0.1/capstone
1 rows affected.

[(30346,)]

In [57]:
%sql select * from stg_city_lat_lon_xref where state='NJ' limit 10;

 * postgresql://student:***@127.0.0.1/capstone
10 rows affected.

[('Absecon', 'NJ', Decimal('39.464390'), Decimal('-74.505799'), Decimal('-5'), Decimal('1'), 2),
 ('Adelphia', 'NJ', Decimal('40.302718'), Decimal('-74.249280'), Decimal('-5'), Decimal('1'), 1),
 ('Allamuchy', 'NJ', Decimal('40.869648'), Decimal('-74.849661'), Decimal('-5'), Decimal('1'), 1),
 ('Allendale', 'NJ', Decimal('41.031505'), Decimal('-74.134090'), Decimal('-5'), Decimal('1'), 1),
 ('Allenhurst', 'NJ', Decimal('40.269817'), Decimal('-74.128090'), Decimal('-5'), Decimal('1'), 2),
 ('Allentown', 'NJ', Decimal('40.164556'), Decimal('-74.577850'), Decimal('-5'), Decimal('1'), 1),
 ('Allenwood', 'NJ', Decimal('40.143860'), Decimal('-74.102860'), Decimal('-5'), Decimal('1'), 1),
 ('Alloway', 'NJ', Decimal('39.559426'), Decimal('-75.363100'), Decimal('-5'), Decimal('1'), 1),
 ('Alpine', 'NJ', Decimal('40.952814'), Decimal('-73.930640'), Decimal('-5'), Decimal('1'), 1),
 ('Andover', 'NJ', Decimal('40.966308'), Decimal('-74.742980'), Decimal('-5'), Decimal('1'), 1)]

In [58]:
%sql select * from stg_city_lat_lon_xref where city='El Paso' limit 20;  -- Springfield and Portland are notoriously multi state cities

 * postgresql://student:***@127.0.0.1/capstone
4 rows affected.

[('El Paso', 'AR', Decimal('35.141743'), Decimal('-92.076410'), Decimal('-6'), Decimal('1'), 1),
 ('El Paso', 'IL', Decimal('40.731662'), Decimal('-89.039780'), Decimal('-6'), Decimal('1'), 1),
 ('El Paso', 'NM', Decimal('31.789109'), Decimal('-106.542910'), Decimal('-7'), Decimal('1'), 1),
 ('El Paso', 'TX', Decimal('31.713183'), Decimal('-106.315936'), Decimal('-7'), Decimal('1'), 156)]

In [59]:
%sql select count(*), state from stg_city_lat_lon_xref group by state order by 1 desc;

 * postgresql://student:***@127.0.0.1/capstone
54 rows affected.

[(1847, 'PA'),
 (1630, 'NY'),
 (1487, 'TX'),
 (1309, 'IL'),
 (1243, 'CA'),
 (1083, 'OH'),
 (964, 'MO'),
 (949, 'IA'),
 (901, 'MI'),
 (852, 'VA'),
 (847, 'KY'),
 (827, 'WV'),
 (823, 'MN'),
 (776, 'WI'),
 (769, 'NC'),
 (752, 'IN'),
 (641, 'KS'),
 (630, 'GA'),
 (622, 'AR'),
 (593, 'OK'),
 (590, 'NJ'),
 (587, 'AL'),
 (554, 'TN'),
 (542, 'FL'),
 (540, 'NE'),
 (507, 'MA'),
 (496, 'LA'),
 (496, 'WA'),
 (479, 'ME'),
 (440, 'MS'),
 (437, 'MD'),
 (410, 'CO'),
 (395, 'SD'),
 (391, 'ND'),
 (384, 'OR'),
 (381, 'SC'),
 (366, 'MT'),
 (353, 'NM'),
 (292, 'VT'),
 (273, 'ID'),
 (271, 'AZ'),
 (270, 'CT'),
 (252, 'NH'),
 (252, 'UT'),
 (230, 'AK'),
 (176, 'WY'),
 (103, 'PR'),
 (101, 'NV'),
 (96, 'HI'),
 (71, 'RI'),
 (59, 'DE'),
 (5, 'VI'),
 (1, 'AS'),
 (1, 'DC')]

In [60]:
%sql select count(*) from stg_city_lat_lon_xref where state is null;

 * postgresql://student:***@127.0.0.1/capstone
1 rows affected.

[(0,)]

In [61]:
%sql select count(*) from stg_city_lat_lon_xref where latitude is null;

 * postgresql://student:***@127.0.0.1/capstone
1 rows affected.

[(0,)]

In [62]:
%sql select count(*) from stg_city_lat_lon_xref where longitude is null;

 * postgresql://student:***@127.0.0.1/capstone
1 rows affected.

[(0,)]